---
kind: property
id: P:Autodesk.Revit.DB.ElementFilter.Inverted
source: html/ceab2eea-cc4c-d7dc-b34c-b3c1f012eda1.htm
---
# Autodesk.Revit.DB.ElementFilter.Inverted Property

True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected,
 and elements that would normally be rejected will be accepted.

## Syntax (C#)
```csharp
public bool Inverted { get; }
```